arduino/ArduinoCore-samd/boards.txt
# Adafruit QT Py M0 (SAMD21)
# ------------------------------
adafruit_qtpy_m0.name=Adafruit QT PY (SAMD21)
adafruit_qtpy_m0.vid.0=0x239A
adafruit_qtpy_m0.pid.0=0x80CB
adafruit_qtpy_m0.vid.1=0x239A
adafruit_qtpy_m0.pid.1=0x00CB
adafruit_qtpy_m0.vid.1=0x239A
adafruit_qtpy_m0.pid.1=0x00CC
adafruit_qtpy_m0.upload.tool=bossac
adafruit_qtpy_m0.upload.protocol=sam-ba
adafruit_qtpy_m0.upload.maximum_size=262144
adafruit_qtpy_m0.upload.offset=0x2000
adafruit_qtpy_m0.upload.use_1200bps_touch=true
adafruit_qtpy_m0.upload.wait_for_upload_port=true
adafruit_qtpy_m0.upload.native_usb=true
adafruit_qtpy_m0.build.mcu=cortex-m0plus
adafruit_qtpy_m0.build.f_cpu=48000000L
adafruit_qtpy_m0.build.usb_product="QT Py M0"
adafruit_qtpy_m0.build.usb_manufacturer="Adafruit"
adafruit_qtpy_m0.build.board=QTPY_M0
adafruit_qtpy_m0.build.core=arduino
adafruit_qtpy_m0.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_QTPY_M0 -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_qtpy_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_qtpy_m0.build.openocdscript=openocd_scripts/trinket_m0.cfg
adafruit_qtpy_m0.build.variant=qtpy_m0
adafruit_qtpy_m0.build.variant_system_lib=
adafruit_qtpy_m0.build.vid=0x239A
adafruit_qtpy_m0.build.pid=0x80CB
adafruit_qtpy_m0.bootloader.tool=openocd
adafruit_qtpy_m0.bootloader.file=qtpyM0/bootloader-qtpy_m0.bin
adafruit_qtpy_m0.menu.opt.small=Small (-Os) (standard)
adafruit_qtpy_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_qtpy_m0.menu.opt.fast=Fast (-O2)
adafruit_qtpy_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_qtpy_m0.menu.opt.faster=Faster (-O3)
adafruit_qtpy_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_qtpy_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_qtpy_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_qtpy_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_qtpy_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_qtpy_m0.menu.usbstack.arduino=Arduino
adafruit_qtpy_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_qtpy_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_qtpy_m0.menu.debug.off=Off
adafruit_qtpy_m0.menu.debug.on=On
adafruit_qtpy_m0.menu.debug.on.build.flags.debug=-g

# Adafruit ItsyBitsy M0 (SAMD21)
# ------------------------------
adafruit_itsybitsy_m0.name=Adafruit ItsyBitsy M0
adafruit_itsybitsy_m0.vid.0=0x239A
adafruit_itsybitsy_m0.pid.0=0x800F
adafruit_itsybitsy_m0.vid.1=0x239A
adafruit_itsybitsy_m0.pid.1=0x000F
adafruit_itsybitsy_m0.vid.2=0x239A
adafruit_itsybitsy_m0.pid.2=0x8012
adafruit_itsybitsy_m0.upload.tool=bossac
adafruit_itsybitsy_m0.upload.protocol=sam-ba
adafruit_itsybitsy_m0.upload.maximum_size=262144
adafruit_itsybitsy_m0.upload.offset=0x2000
adafruit_itsybitsy_m0.upload.use_1200bps_touch=true
adafruit_itsybitsy_m0.upload.wait_for_upload_port=true
adafruit_itsybitsy_m0.upload.native_usb=true
adafruit_itsybitsy_m0.build.mcu=cortex-m0plus
adafruit_itsybitsy_m0.build.f_cpu=48000000L
adafruit_itsybitsy_m0.build.usb_product="ItsyBitsy M0 Express"
adafruit_itsybitsy_m0.build.usb_manufacturer="Adafruit"
adafruit_itsybitsy_m0.build.board=ITSYBITSY_M0
adafruit_itsybitsy_m0.build.core=arduino
adafruit_itsybitsy_m0.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_ITSYBITSY_M0 -D__SAMD21G18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_itsybitsy_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_itsybitsy_m0.build.openocdscript=openocd_scripts/itsybitsy_m0.cfg
adafruit_itsybitsy_m0.build.variant=itsybitsy_m0
adafruit_itsybitsy_m0.build.variant_system_lib=
adafruit_itsybitsy_m0.build.vid=0x239A
adafruit_itsybitsy_m0.build.pid=0x800F
adafruit_itsybitsy_m0.bootloader.tool=openocd
adafruit_itsybitsy_m0.bootloader.file=itsybitsyM0/bootloader-itsybitsy_m0-v2.0.0-adafruit.5.bin
adafruit_itsybitsy_m0.menu.opt.small=Small (-Os) (standard)
adafruit_itsybitsy_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_itsybitsy_m0.menu.opt.fast=Fast (-O2)
adafruit_itsybitsy_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_itsybitsy_m0.menu.opt.faster=Faster (-O3)
adafruit_itsybitsy_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_itsybitsy_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_itsybitsy_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_itsybitsy_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_itsybitsy_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_itsybitsy_m0.menu.usbstack.arduino=Arduino
adafruit_itsybitsy_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_itsybitsy_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_itsybitsy_m0.menu.debug.off=Off
adafruit_itsybitsy_m0.menu.debug.on=On
adafruit_itsybitsy_m0.menu.debug.on.build.flags.debug=-g


# Adafruit PIRkey (SAMD21)
# ------------------------------
adafruit_pirkey.name=Adafruit pIRkey
adafruit_pirkey.vid.0=0x239A
adafruit_pirkey.pid.0=0x801E
adafruit_pirkey.vid.1=0x239A
adafruit_pirkey.pid.1=0x001E
adafruit_pirkey.upload.tool=bossac
adafruit_pirkey.upload.protocol=sam-ba
adafruit_pirkey.upload.maximum_size=262144
adafruit_pirkey.upload.offset=0x2000
adafruit_pirkey.upload.use_1200bps_touch=true
adafruit_pirkey.upload.wait_for_upload_port=true
adafruit_pirkey.upload.native_usb=true
adafruit_pirkey.build.mcu=cortex-m0plus
adafruit_pirkey.build.f_cpu=48000000L
adafruit_pirkey.build.usb_product="pIRKey"
adafruit_pirkey.build.usb_manufacturer="Adafruit"
adafruit_pirkey.build.board=PIRKEY
adafruit_pirkey.build.core=arduino
adafruit_pirkey.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_PIRKEY -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_pirkey.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_pirkey.build.openocdscript=openocd_scripts/arduino_zero.cfg
adafruit_pirkey.build.variant=pirkey
adafruit_pirkey.build.variant_system_lib=
adafruit_pirkey.build.vid=0x239A
adafruit_pirkey.build.pid=0x801E
adafruit_pirkey.bootloader.tool=openocd
adafruit_pirkey.bootloader.file=pirkey/bootloader-pirkey-v2.0.0-adafruit.5.bin
adafruit_pirkey.menu.opt.small=Small (-Os) (standard)
adafruit_pirkey.menu.opt.small.build.flags.optimize=-Os
adafruit_pirkey.menu.opt.fast=Fast (-O2)
adafruit_pirkey.menu.opt.fast.build.flags.optimize=-O2
adafruit_pirkey.menu.opt.faster=Faster (-O3)
adafruit_pirkey.menu.opt.faster.build.flags.optimize=-O3
adafruit_pirkey.menu.opt.fastest=Fastest (-Ofast)
adafruit_pirkey.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_pirkey.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_pirkey.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_pirkey.menu.usbstack.arduino=Arduino
adafruit_pirkey.menu.usbstack.tinyusb=TinyUSB
adafruit_pirkey.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

